plugins/MenuBuilder/MenuBuilderFrontendRender.php

    public function render_frrontend_panel_menu($id)
    {

        $output = '';
        if (empty($id)) {
            return $output;
        }
        $menu_details_from_db = Menu::find($id);
---
select * from `menus` where `menus`.`id` in (1, 0, 0, 0, 2022, 2024)