plugins/PageBuilder/Addons/Tenants/Furnito/Product/TrendingProducts.php

select * from `badges` where `badges`.`id` in ('', '2') and `badges`.`deleted_at` is null
select * from `campaign_products` where `campaign_products`.`product_id` in (203, 244, 251, 263)
select * from `product_inventory_details` where `product_inventory_details`.`product_id` in (203, 244, 251, 263)
---
    public function frontend_render()
    {
        $product_id = $this->setting_item('products');
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? '');
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle') ?? '');
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $item_order = SanitizeInput::esc_html($this->setting_item('item_order') ?? 'asc');

        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $products = Product::with('badge', 'campaign_product', 'inventory', 'inventoryDetail')
                    ->where('status_id', 1)
                    ->whereIn('id', $product_id ?? [])
                    ->withSum('taxOptions', 'rate')
                    ->orderBy('created_at', $item_order ?? 'desc')
                    ->take($item_show ?? 4)->get();