plugins/WidgetBuilder/Widgets/Tenants/ThemeOne/FooterBottomLinksWidget.php

select * from `menus` where `menus`.`id` = '1' limit 1
---
    public function frontend_render()
    {
        // TODO: Implement frontend_render() method.
        $widget_saved_values = $this->get_settings();
        $widget_title = SanitizeInput::esc_html($widget_saved_values['title'] ?? '');
        $widget_navbar = SanitizeInput::esc_url($widget_saved_values['navbar_link']) ?? '';

        $instance = Menu::findOrFail($widget_navbar);