plugins/WidgetBuilder/WidgetBase.php

    public function get_settings($lang = null)
    {
        if (!$lang) {
            $lang = app()->getLocale();
        }
        $widget_data = !empty($this->args['id']) ? Widgets::find($this->args['id']) : null;
---
select * from `widgets` where `widgets`.`id` = 9 limit 1