app/Http/Controllers/Landlord/Frontend/LandlordFrontendController.php

    public function homepage(Request $request)
    {


        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();
---
select * from `pages` where `id` = '1' limit 1

    public function setLocale(Request $request, UrlGenerator $urlGenerator, $param)
    {
        $previousUrl = $request->headers->get('referer');
        $currentRoute = $request->route();
        $previousRoute = $urlGenerator->previous();
        $localeLang = app()->getLocale();
        session(['lang' => $param]);
        if (str_contains($previousRoute, 'blog/')) {
            $blogData = explode('blog/', $previousRoute);
            $blog = Blog::query()
                ->where('slug->' . $localeLang, '=', $blogData[1])
                ->first();
            return redirect()->route(route_prefix() . 'frontend.blog.single', $blog->getTranslation('slug', $param));
        } else {

            $domain = $request->getHttpHost();

            $kalan = explode($domain, $previousRoute);
            $kalan = ltrim($kalan[1], '/');

            if ($kalan == '') {
                return redirect()->back();
            }
            $page = Page::query()
                ->where('slug->' . $localeLang, '=', $kalan)
                ->first();
---
select * from `pages` where json_unquote(json_extract(`slug`, '$."az"')) = 'set-locale/en_GB' limit 1

    public function dynamic_single_page($slug)
    {
        $page_post = Page::query()
            ->where('slug->' . app()->getLocale(), $slug)
            ->first();

        if (!$page_post) {
            $languages = Language::query()->where('status', '=', 1)
                ->get();
            foreach ($languages as $lang) {
                $page_post = Page::query()
                    ->where('slug->' . $lang->slug, $slug)
                    ->first();
---
select * from `pages` where json_unquote(json_extract(`slug`, '$."az"')) = 'domashnyaya-stranitsa' limit 1
select * from `languages` where `status` = 1
select * from `pages` where json_unquote(json_extract(`slug`, '$."en_GB"')) = 'domashnyaya-stranitsa' limit 1

    public function plan_order($id)
    {
        abort_if(empty($id), 404);

        $order_details = PricePlan::findOrFail($id);
        $payment_gateways = PaymentGateway::where('name', 'manual_payment')->first();
---
select * from `price_plans` where `price_plans`.`id` = '3' limit 1
select * from `payment_gateways` where `name` = 'manual_payment' limit 1

    public function showTenantRegistrationForm()
    {
        $plan_id = \request()->p ?? '';
        abort_if(!empty($plan_id) && empty(PricePlan::find($plan_id)), 404);
---
select * from `price_plans` where `price_plans`.`id` = '3' limit 1