plugins/PageBuilder/PageBuilderBase.php

select * from `page_builders` where `page_builders`.`id` = 1 limit 1
---
    public function get_settings()
    {
        $widget_data = !empty($this->args['id']) ? PageBuilder::find($this->args['id']) : [];