Modules/MobileApp/Http/Middleware/StartingMobile.php

    public function handle(Request $request, Closure $next){
                $language_default = 'en_GB';
            	$language_select = 'en_GB';

                if($request->get('lang')){
    				$language = \App\Models\Language::select('id','slug')->where('slug',$request->get('lang'))->first();
    				if(!empty($language)){
            				        $language_select = $language->slug;
            	                    $language = \App\Models\Language::select('id','name','slug','direction')->where('default',1)->first();
            	                    if(!empty($language)){
            						    $language_default = $language->slug;
            	                    }
            				}else{
            					$language = \App\Models\Language::select('id','name','slug','direction')->where('default',1)->first();
            					if(!empty($language)){
            							$language_default = $language->slug;
            					        $language_select = $language->slug;
            					}
            				}

            		 }else{
        			     $language = \App\Models\Language::select('id','name','slug','direction')->where('default',1)->first();
---
select `id`, `name`, `slug`, `direction` from `languages` where `default` = 1 limit 1