app/Http/Controllers/Tenant/Frontend/TenantFrontendController.php

select * from `pages` where `id` = '1' limit 1
---
    public function homepage()
    {
        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();

select * from `pages` where json_unquote(json_extract(`slug`, '$."az"')) = 'kateqoriyalar' limit 1
select count(*) as aggregate from `products` where `status_id` = 1 and `products`.`deleted_at` is null
select `id`, `name`, `size_code`, `slug` from `sizes` where exists (select * from `product_inventory_details` where `sizes`.`id` = `product_inventory_details`.`size`)
select `id`, `name`, `color_code`, `slug` from `colors`
select distinct `tag_name` from `product_tags` where exists (select * from `products` where `product_tags`.`product_id` = `products`.`id` and `products`.`deleted_at` is null)
---
    public function dynamic_single_page($slug)
    {
        $page_post = Page::query()
            ->where('slug->' . app()->getLocale(), $slug)
            ->firstOrFail();

        abort_if(empty($page_post), 404);

        $blog_page_slug = get_page_slug(get_static_option('blog_page'), 'blog_page');
        if ($slug === $blog_page_slug) {
            if (tenant()) {
                $sorting = blog_sorting(request());
                $order_by = $sorting['order_by'];
                $order = $sorting['order'];
                $order_type = $sorting['order_type'];

                $blogs = Blog::where('status', 1)->orderBy($order_by, $order)->paginate(get_static_option('blog_page_item_show') ?? 9);

                return view('blog::tenant.frontend.blog.blog-all')->with([
                    'page_post' => $page_post,
                    'blogs' => $blogs,
                    'order_type' => $order_type
                ]);
            }
        }

        $shop_page_slug = get_page_slug(get_static_option('shop_page'), 'shop_page');
        if ($slug === $shop_page_slug) {
            if (tenant()) {
                $product_object = Product::where('status_id', 1)->latest()->withSum('taxOptions', 'rate')->paginate(12);
                $categories = Category::whereHas('product', function ($query) {
                    $query->where('status_id', 1);
                })->select('id', 'name', 'slug')->withCount('product')->get();
                $sizes = Size::whereHas('product_sizes')->select('id', 'name', 'size_code', 'slug')->get();
                $colors = Color::select('id', 'name', 'color_code', 'slug')->get();
                $tags = ProductTag::whereHas('product')->select('tag_name')->distinct()->get();

select `product_categories`.`product_id` from `product_categories` where `product_id` != 195 and `category_id` = 8
select * from `product_categories`
select * from `product_uom`
select max(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select min(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select * from `product_tags`
---
    public function product_details($slug)
    {
        extract($this->productVariant($slug));

        $sub_category_arr = json_decode($product->sub_category_id, true);

        // related products
        $product_category = $product?->category?->id;
        $product_id = $product->id;
        $related_products = Product::where('status_id', 1)
            ->whereIn('id', function ($query) use ($product_id, $product_category) {
                $query->select('product_categories.product_id')
                    ->from(with(new ProductCategory())->getTable())
                    ->where('product_id', '!=', $product_id)
                    ->where('category_id', '=', $product_category)
                    ->get();
            })
            ->withSum('taxOptions', 'rate')
            ->inRandomOrder()
            ->take(5)
            ->get();

        // sidebar data
        $all_category = ProductCategory::all();
        $all_units = ProductUom::all();
        $maximum_available_price = Product::query()->with('category')->max('price');
        $min_price = request()->pr_min ? request()->pr_min : Product::query()->min('price');
        $max_price = request()->pr_max ? request()->pr_max : $maximum_available_price;
        $all_tags = ProductTag::all();

select `product_categories`.`product_id` from `product_categories` where `product_id` != 195 and `category_id` = 8
select * from `product_categories`
select * from `product_uom`
select max(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select min(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select * from `product_tags`
---
    public function productQuickViewPage($slug): string
    {
        extract($this->productVariant($slug));

        $sub_category_arr = json_decode($product->sub_category_id, true);

        // related products
        $product_category = $product?->category?->id;
        $product_id = $product->id;
        $related_products = Product::where('status_id', 1)
            ->whereIn('id', function ($query) use ($product_id, $product_category) {
                $query->select('product_categories.product_id')
                    ->from(with(new ProductCategory())->getTable())
                    ->where('product_id', '!=', $product_id)
                    ->where('category_id', '=', $product_category)
                    ->get();
            })
            ->withSum('taxOptions', 'rate')
            ->inRandomOrder()
            ->take(5)
            ->get();

        // sidebar data
        $all_category = ProductCategory::all();
        $all_units = ProductUom::all();
        $maximum_available_price = Product::query()->with('category')->max('price');
        $min_price = request()->pr_min ? request()->pr_min : Product::query()->min('price');
        $max_price = request()->pr_max ? request()->pr_max : $maximum_available_price;
        $all_tags = ProductTag::all();

select * from `product_inventory_details` where `product_inventory_details`.`product_id` in (195)
select `categories`.*, `product_categories`.`product_id` as `laravel_through_key` from `categories` inner join `product_categories` on `product_categories`.`category_id` = `categories`.`id` where `product_categories`.`product_id` in (195) and `categories`.`deleted_at` is null
select `colors`.*, `product_inventory_details`.`product_id` as `laravel_through_key` from `colors` inner join `product_inventory_details` on `product_inventory_details`.`color` = `colors`.`id` where `product_inventory_details`.`product_id` in (195)
select `sizes`.*, `product_inventory_details`.`product_id` as `laravel_through_key` from `sizes` inner join `product_inventory_details` on `product_inventory_details`.`size` = `sizes`.`id` where `product_inventory_details`.`product_id` in (195)
---
    public function productVariant($slug)
    {
        $product = Product::where('slug->' . app()->getLocale(), $slug);

        $urlGenetator = UrlGenerator::class;
        $request = Request::class;

        if (!$product->first()) {
            $languages = Language::query()->where('status', '=', 1)->get();
            foreach ($languages as $language) {
                if (app()->getLocale() != $language->slug) {
                    $product = Product::where('slug->' . $language->slug, $slug);
                    if ($product->first()) {
                        $this->setLocaleTenantProduct($language->slug, $slug);
                        break;
                    }
                }
            }
        }

        // dd('burdaa', app()->getLocale());
        $product = Product::where('slug->' . app()->getLocale(), $slug)->with(
            'category',
            'tag',
            'color',
            'sizes',
            'inventoryDetail',
            'inventoryDetail.productColor',
            'inventoryDetail.productSize',
            'inventoryDetail.attribute',
            'reviews'
        )
            ->where("status_id", 1)
            ->withSum('taxOptions', 'rate')
            ->firstOrFail();

select * from `static_options` where `option_name` in ('product_in_stock_text', 'product_out_of_stock_text', 'details_tab_text', 'additional_information_text', 'reviews_text', 'your_reviews_text', 'write_your_feedback_text', 'post_your_feedback_text')
---
        $available_attributes = array_map(fn($i) => array_keys($i), $available_attributes);


        $setting_text = StaticOption::whereIn('option_name', [
            'product_in_stock_text',
            'product_out_of_stock_text',
            'details_tab_text',
            'additional_information_text',
            'reviews_text',
            'your_reviews_text',
            'write_your_feedback_text',
            'post_your_feedback_text',
        ])->get()->mapWithKeys(fn($item) => [$item->option_name => $item->option_value])->toArray();

select `id`, `name` from `categories` where json_unquote(json_extract(`slug`, '$."az"')) = 'man' and `categories`.`deleted_at` is null limit 1
select `product_id` from `product_categories` where `category_id` = 10
select `id`, `name` from `sub_categories` where json_unquote(json_extract(`slug`, '$."az"')) = 'jacket' and `sub_categories`.`deleted_at` is null limit 1
select `product_id` from `product_sub_categories` where `sub_category_id` = 11
select `id`, `name` from `child_categories` where json_unquote(json_extract(`slug`, '$."az"')) = 'leather-jacket' and `child_categories`.`deleted_at` is null limit 1
select `product_id` from `product_child_categories` where `child_category_id` = 15
select count(*) as aggregate from `products` where `id` in ('193') and `products`.`deleted_at` is null
---
  public function category_products($slug, $category_type = null)
    {


        // TODO::: burada bir değişiklik olacak
        $type = ['category', 'subcategory', 'child-category'];
        abort_if(!in_array($category_type, $type), 404);


        if ($category_type == 'category') {
            $category = Category::where('slug->' . app()->getLocale(), $slug)->select('id', 'name')->firstOrFail();
            $products_id = ProductCategory::where('category_id', $category->id)->select('product_id')->pluck('product_id');
        } elseif ($category_type == 'subcategory') {
            $category = SubCategory::where('slug->' . app()->getLocale(), $slug)->select('id', 'name')->firstOrFail();


            $products_id = ProductSubCategory::where('sub_category_id', $category->id)->select('product_id')->pluck('product_id');
        } else {
            $category = ChildCategory::where('slug->' . app()->getLocale(), $slug)->select('id', 'name')->firstOrFail();
            $products_id = ProductChildCategory::where('child_category_id', $category->id)->select('product_id')->pluck('product_id');
        }

        $products = Product::whereIn('id', $products_id)->paginate(12);