app/Helpers/FormBuilderCustom.php

select * from `form_builders` where `form_builders`.`id` = 1 limit 1
---
    public static function render_form($id,$form_id = null,$action = null,$button_class = null,$form_class = null){
        $form_details = \App\Models\FormBuilder::find($id);