app/Helpers/funtions.php

select * from `static_options` where `option_name` = 'timezone' limit 1
---
function get_static_option($option_name, $default = null)
{

    static $in_memory_cache = [];

    if (array_key_exists($option_name, $in_memory_cache)) {
        return $in_memory_cache[$option_name];
    }


    $value = Cache::remember($option_name, 24 * 60 * 60, function () use ($option_name) {
        try {

            return StaticOption::where('option_name', $option_name)->first();

select * from `static_options` where `option_name` = 'error_image' limit 1
---
function get_static_option_convert($option_name)
{
    $value = StaticOption::where('option_name', $option_name)->first();

select * from `static_option_centrals` where `option_name` = 'storage_driver' limit 1
---
function get_static_option_central($option_name, $default = null)
{


    $value = Cache::remember($option_name, 60, function () use ($option_name) {
        try {
            return \App\Models\StaticOptionCentral::where('option_name', $option_name)->first();

select * from `media_uploaders` where `media_uploaders`.`id` is null limit 1
---
function get_attachment_image_by_id($id, $size = null, $default = false)
{
    $image_details = Cache::remember('media_image_' . $id, 60 * 60 * 24, function () use ($id) {
        return \App\Models\MediaUploader::find($id);

select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` = 'en_GB' limit 1
---
function get_default_language()
{
    $defaultLang = \App\Models\Language::where('default', 1)->first();

    $fallback_lang = \App\Models\Language::where('slug', 'en_GB')->first();

select * from `pages` where `id` is null limit 1
---
function get_page_slug($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->first()->slug ?? $default;

select * from `widgets` where (`widget_location` = 'footer') order by `widget_order` asc
---
function render_frontend_sidebar($location, $args = [])
{

    $output = '';
    $all_widgets = \App\Models\Widgets::where(['widget_location' => $location])->orderBy('widget_order', 'ASC')->get();

select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` = 'en_GB' limit 1
---
function get_user_lang_direction()
{
    $default = \App\Models\Language::where('default', 1)->first();
    $user_direction = \App\Models\Language::where('slug', session()->get('lang'))->first();

    $fallback_lang = \App\Models\Language::where('slug', 'en_GB')->first();

select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` is null limit 1
---
function get_user_lang_bool_direction()
{
    $default = \App\Models\Language::where('default', 1)->first();
    $user_direction = \App\Models\Language::where('slug', session()->get('lang'))->first();

select * from `languages` where `status` = 1
---
function get_all_language()
{
    return \App\Models\Language::query()
        ->where('status', '=', 1)
        ->get();