Modules/Blog/Http/Controllers/Tenant/Frontend/BlogController.php

select * from `blog_categories` where `blog_categories`.`id` in (9)
select * from `blog_comments` where `blog_comments`.`blog_id` in (6)
select * from `blogs` where (json_unquote(json_extract(`slug`, '$."az"')) = 'do-enjoyment-defective-objection-or-we-if-favourite' and `status` = 1) limit 1
select * from `users` where 0 = 1 and `users`.`deleted_at` is null
select * from `blog_comments` where (`blog_id` = 6 and `parent_id` is null) order by `created_at` desc limit 3
select count(*) as aggregate from `blog_comments` where (`blog_id` = 6 and `parent_id` is null)
select `id`, `title`, `slug` from `blog_tags` order by `created_at` desc limit 15
---
    public function blog_single($slug)
    {
        $localeLang = app()->getLocale();


        $blog_post = Blog::with(['user', 'category', 'comments'])->where(['slug->' . $localeLang => $slug, 'status' => 1])->first();

        if (!$blog_post) {

            $languages = Language::query()->where('status', '=', 1)->get();
            foreach ($languages as $language) {
                if (app()->getLocale() != $language->slug) {
                    $blog_post = Blog::with(['user', 'category', 'comments'])->where(['slug->' . $language->slug => $slug, 'status' => 1])->first();
                    if ($blog_post) {
                        $this->setLocaleTenantBlog($language->slug, $slug);
                        break;
                    }
                }
            }
        }

        if (!$blog_post) {
            abort(404);
        }
        $blog_comments = BlogComment::where(['blog_id' => $blog_post->id, 'parent_id' => null])->orderByDesc('created_at')->take(3)->get();
        $blog_comments_count = BlogComment::where(['blog_id' => $blog_post->id, 'parent_id' => null])->count();

        $all_category = BlogCategory::withCount('blogs')->has('blogs')->get();
        $all_tags = BlogTag::orderByDesc('created_at')->select('id','title','slug')->take(15)->get();

select count(*) as aggregate from `blogs` where `tags` LIKE '%camera%'
---
    public function tags_wise_blog_page($tag)
    {
        $sorting = blog_sorting(request());
        $order_by = $sorting['order_by'];
        $order = $sorting['order'];
        $order_type = $sorting['order_type'];

        $all_blogs = Blog::Where('tags', 'LIKE', '%' . $tag . '%')
            ->orderBy($order_by, $order)->paginate(get_static_option('blog_tag_item_show') ?? 9);