plugins/PageBuilder/Addons/Tenants/Aromatic/Product/NewCollection.php

select * from `badges` where `badges`.`id` in ('', '2', '3') and `badges`.`deleted_at` is null
select * from `campaign_products` where `campaign_products`.`product_id` in (190, 191, 192, 193)
select * from `product_inventory_details` where `product_inventory_details`.`product_id` in (190, 191, 192, 193)
---
    public function frontend_render()
    {
        $product_id = $this->setting_item('products');
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? '');
        $title_line = $this->setting_item('title_line');
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $item_order = SanitizeInput::esc_html($this->setting_item('item_order') ?? '');

        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $products = Product::with('badge', 'campaign_product', 'inventory', 'inventoryDetail')
                    ->where('status_id', 1);

        if (!empty($product_id))
        {
            $products->whereIn('id', $product_id);
        }

        $products = $products->orderBy('created_at', $item_order != '' ? $item_order : 'desc')->withSum('taxOptions', 'rate')->take($item_show ?? 4)->get();