Modules/MobileApp/Http/Controllers/MobileController.php

    public function site_currency_symbol(){
             $is_rtl_on_or_not = get_user_lang_direction() == 1 ?? false;
			 $symbol = StaticOption::where('option_name', 'site_custom_currency_symbol')->first();
---
select * from `static_options` where `option_name` = 'site_custom_currency_symbol' limit 1